

phrases = {'start': ['If you would like to see the features of this bot, click on the button:\nMenu📋\nAlso, you can configure something by clicking on the button:\n Settings⚙️','Чтобы ознакомиться с возможностями бота, нажмите на кнопку:\nМеню📋\nТакже вы можете что-либо настроить, нажав на кнопку:\n Настройки⚙️'], 
            'language': ['Сhoose the language:', 'Выберите язык:'],
            'start_text': '''Сhoose language\nВыберите язык''',
            'languages_type': ['English', 'Русский'],
            'languages_type_1': ['English(en)', 'Русский(ru)'],
            'langs': ['Your language: ', 'Ваш язык: '], 
            'languages_o': ['Language🌏', 'Язык🌏'],
            'menu': ['Menu📋', 'Меню📋'],
            'settings': ['Settings⚙️', 'Настройки⚙️'],
            'back': ['⬅️Back', '⬅️Назад'],
            'back_menu': ['⬅️Back(Menu)', '⬅️Назад(Меню)'],
            'back_start': ['⬅️Back(Start)', '⬅️Назад(Начало)'],
            'back_settings': ['⬅️Back(Settings)', '⬅️Назад(Настройки)'],
            'choose': ['Choose "Language", if you would like to change language, or choose "Creator" to get username of the human who did it.', 'Выберите "Язык", если вы хотите поменять язык, или выберите "Разработчик", чтобы узнать никнейм разработчика.'],
            'menu_text': ['''If you would like to get the forecast of the weather or the statistic, press on the buttons: 'Get weather' or 'Get statistics' accordingly.''', '''Чтобы получить погоду или статистику, поиграть "в  города" нажмите на кнопки: 'Получить погоду🌤', 'Получить статистику📈' или 'Игра в города👾' соответственно.'''],
            'more': ['More', 'Больше'],
            'quests': 
                {'weather': ['Get weather🌤', 'Получить погоду🌤'], 
                 'stats': ['Get statistics📈', 'Получить статистику📈']},
            'weather': 
                {'weather_text': ["You can ask bot to give you the forecast of the weather now, today, tomorrow, day after tomorrow and for this week by commands:\n'Now', 'Today', 'Tomorrow', 'Day after tomorrow', 'Week' accordingly.", "Вы можете спросить у бота погоду на сейчас, на сегодня, на завтра, на послезавтра или на неделю командами:\n'Сейчас', 'Сегодня', 'Завтра', 'Послезавтра', 'Неделя' соответственно."],
                 'now': ['Now', 'Сейчас'],
                 'today': ['Today', 'Сегодня'], 
                 'tomorrow': ['Tomorrow', 'Завтра'],
                 'day_after_tomorrow': ['Day after tomorrow', 'Послезавтра'], 
                 'week': ['Week', 'Неделя'],
                 'after': ['After ', 'Через '],
                 'days_1': ['days', 'дня'],
                 'days_2': ['days', 'дней'],
                 'week_0': ['week', 'неделю']},
            'weather_or_stat': ['''Today weather or today statistics?''', '''Погода на сегодня или статистику на сегодня?'''],
            'statistic':
                {'stats_text': ['''Enter these commands or choose them on the special keyboard to get the information about the number of users or requests today or for whole period of time:\n'Number of users today', 'Number of all users', 'Number of requests today', 'Number of all requests'.''', '''Чтобы посмотреть количество пользователей или запросов за сегодня или за весь период, введите данные команды или выберите их на специальной клавиатуре:\n'Кол-во пользователей за сегодня','Кол-во пользователей за все время', 'Кол-во запросов за сегодня', 'Кол-во запросов за все время'.'''],
                 'stats_text_p': ['''Enter these commands or choose them on the special keyboard to get the information about the number of users today or for whole period of time:\n'Number of users today', 'Number of all users', 'Number of requests today', 'Number of all requests'.''', '''Чтобы посмотреть количество пользователей за сегодня или за весь период, введите данные команды или выберите их на специальной клавиатуре:\n'Кол-во пользователей за сегодня','Кол-во пользователей за все время', 'Кол-во запросов за сегодня', 'Кол-во запросов за все время'.'''],
                 'stats_text_q': ['''Enter these commands or choose them on the special keyboard to get the information about the number of requests today or for whole period of time:\n'Number of requests today', 'Number of all requests'.''', '''Чтобы посмотреть количество запросов за сегодня или за весь период, введите данные команды или выберите их на специальной клавиатуре:\n'Кол-во запросов за сегодня', 'Кол-во запросов за все время'.'''],
                 'stats_text_pq_today': ['''Enter these commands or choose them on the special keyboard to get the information about the number of users or requests today:\n'Number of users today', 'Number of requests today'.''', '''Чтобы посмотреть количество пользователей или запросов за сегодня, введите данные команды или выберите их на специальной клавиатуре:\n'Кол-во пользователей за сегодня', 'Кол-во запросов за сегодня'.'''],
                 'stats_text_pq_all': ['''Enter these commands or choose them on the special keyboard to get the information about the number of requests today or for whole period of time:\n'Number of all users', 'Number of all requests'.''', '''Чтобы посмотреть количество запросов за сегодня или за весь период, введите данные команды или выберите их на специальной клавиатуре:\n'Кол-во пользователей за все время', 'Кол-во запросов за все время'.'''],
                 'all_users': ['Number of all users', 'Кол-во пользователей за все время'],
                 'today_users': ['Number of users today', 'Кол-во пользователей за сегодня'],
                 'all_requests': ['Number of all requests', 'Кол-во запросов за все время'], 
                 'today_requests': ['Number of requests today', 'Кол-во запросов за сегодня']},
            'errors': 
                {'photo_error': ["Excuse me, but I didn't find photos of this town.☹️",'Извините, но фотографий этого города я не нашёл.☹️'],
                 'poem_error': ["I couldn't find a poem for you.😞", 'Я не смог найти стихотворение для тебя😞'],
                 'top_error': ['Error! Something went wrong.🙁','Ошибка! Что-то пошло не так.🙁'], 
                 'top_0_error': ["Couldn't find it.🙁", 'Не получилось найти.🙁']},
            'geolocation': ['Send the location', 'Отправить местоположение'],
            'place_input':
                {'now': ['Enter the name of the town the forecast of the weather in which you would like to know at the moment:','Введите название города, где вы хотите узнать погоду на сейчас:'],
                 'today': ['Enter the name of the town the forecast of the weather in which you would like to know for today:','Введите название города, где вы хотите узнать погоду на сегодня:'],
                 'tomorrow': ['Enter the name of the town the forecast of the weather in which you would like to know for tomorrow:','Введите название города, где вы хотите узнать погоду на завтра:'],
                 'day_after_tomorrow': ['Enter the name of the town the forecast of the weather in which you would like to know for the day after tomorrow:','Введите название города, где вы хотите узнать погоду на послезавтра:'],
                 'week': ['Enter the name of the town the forecast of the weather in which you would like to know for this week:','Введите название города, где вы хотите узнать погоду на эту неделю:']},
            'characteristics': 
                {'humidity': ['\nHumidity: ', '\nВлажность: '],
                 'time_all':
                     {'sunrise': ['\nSunrise time: ', '\nВосход: '],
                      'sunset': ['\nSunset time: ', '\nЗакат: '],
                      'timezone': [' (UTC)', ' (МСК)'],
                      'time': ['\nTime: ', '\nВремя: ']},
                 'type': ['\nType of precipitation: ', '\nТип осадков: '], 
                 'temperature': 
                     {'usual':['\nTemperature: ', '\nТемпература: '],
                      'max': ['\nMax temperature: ', '\nСамая высокая температура: '],
                      'min': ['\nMin temperature: ', '\nСамая низкая температура: '],
                      'feeling': ['\nFeels like ', '\nЧувствуется как ']},
                 'wind': 
                     {'speed': ['\nWind speed: ', '\nСкорость ветра: '], 
                      'unit': [' m/s', ' м/с'],
                      'max': ['\nGusts of wind reach ', '\nПорывы ветра достигают ']},
                 'pressure': 
                     {'name': ['\nAtmospheric pressure: ', '\nАтмоферное давление: '],
                      'unit': [' mm Hg', ' мм рт.ст.']},
                 'visibility': 
                     {'name': ['\nVisibility: ', '\nВидимость: '],
                      'unit': [' km', ' км']}},
            'stat_answers': 
                {'users_today': ["Number of today's users  is ", 'Количество пользователей за сегодня равно '],
                 'users_all': ['Number of all users is ', 'Количество пользователей за все время равно '], 
                 'requests_all': ['Number of all requests is ', 'Количество запросов за все время равно '],
                 'requests_today': ["Number of today's requests  is ", 'Количество запросов за сегодня равно ']},
            'stat_db': 
                {'users_today': 'Количество пользователей за сегодня.',
                 'users_all': 'Количество пользователей за все время.', 
                 'requests_all': 'Количество запросов за все время.',
                 'requests_today': 'Количество запросов за сегодня.'},
            'developing': ['Creator👨🏻‍💻', 'Разработчик👨🏻‍💻'],
            'n_u': ['I don`t understand.', 'Я не понимаю.'], 
            'game': 
                {'glhf': 'Приятной игры!)',
                'write_town': 'Для начала напишите какой-нибудь город.',
                'write_other_town': 'Такого города нет. Назовите другой город.',
                'town_inf': 'Информация о городе {}',
                'write_town_with_letter': 'Назовите город на букву "{}"',
                'write_other_town_with_letter': 'Такого города нет, или он уже был назван. Назовите другой город (на букву "{}").',
                'write_town_with_other_letter': 'Название города должно начинаться на другую букву (на букву "{}"). Назовите другой город.',
                'congrats_letter': '*Поздравляю, ты выиграл (городов на букву "{}" больше нет)!*',
                'congrats': '*Поздравляю ты выиграл!*',
                'defeat': '*Ты проиграл, слов на букву "{}" больше нет.*',
                'inf': 'Информация', 
                'all_inf': '{}\nПодробнее: https://ru.wikipedia.org/wiki/{}', 
                'no_inf': 'Извините, но я не смог найти информацию о городе {}.\n Вы можете поискать информацию на сайте:\n https://ru.wikipedia.org/wiki/{}',
                'advanced_rules': '''
*Правила игры*\n 
Игрок называет российский город, после чего другой игрок придумывает город на последнюю букву предыдущего города.
Название городов должно быть точным(1-ая буква - заглавная; если есть тире, надо поставить тире; если есть пробел, надо поставить пробел и т.д.).
НО буква "ё" всегда заменяется на "е"!!!
Елси последняя буква - "ы", "ъ" или "ь", то берется предыдущая буква, и название города будет на нее; 
Если предпоследняя буква - "ы", "ъ" или "ь", то берется предыдущая буква, и название города будет на нее и тд.
Нельзя повторяться.
Чтобы выиграть, необходимо назвать 15 городов(одному игроку).
Также, вы сможете посмотреть краткую информацию о каждом названном городе нажав на кнопку "Информация".
                                   ''',
                'short_rules':     '''
*Правила игры*\n
Игрок называет российский город, после чего другой игрок придумывает город на последнюю букву предыдущего города.
                                   '''
                }
            }


def take_phrase_1(word, lang_num):
    return phrases[word][lang_num]


def take_phrase_2(word_1, word_2, lang_num):
    return phrases[word_1][word_2][lang_num]


def take_character_1(word, lang_num):
    return phrases['characteristics'][word][lang_num]


def take_character_2(word_1, word_2, lang_num):
    return phrases['characteristics'][word_1][word_2][lang_num]


def take_game_phrase(word):
    return phrases['game'][word]
